src/emacs-packages-orgmode.org
#+Title: Emacs Orgmode Introduction
#+Author: yanyg
#+Email: yygcode@gmail.com

* What is Orgmode
Orgmode is a system for note taking and project planning using plain text files.
The author is [[https://staff.science.uva.nl/c.dominik/][Carsten Dominik]], created in 2003.

Ref Orgmode [[http://orgmode.org/][Homepage]] and [[https://www.youtube.com/watch?v=oJTwQvgfgMM][Youtube]] for more details

Core advantage: Plain text [[http://gettingthingsdone.com/][GTD]] tools. Truely Portable Format. Working together
with UNIX tools(e.g.: grep), git, and process easily by python, shell, etc.

* Functions
- Outline
- Planning
- Schedule
- Capture
- Sparse Tree
- Agenda View
- Export
- Publish
- Tables

* Index
** Website
- [[https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org][一年成为 Emacs 高手 (像神一样使用编辑器)]]
- [[https://www.sanityinc.com/][Steve Purcell]]
- [[https://cestlaz.github.io/stories/emacs/][Using Emacs Series]] ([[https://github.com/zamansky/using-emacs/][Using Emacs]] [[https://cestlaz.github.io/][Github IO]])

** Youtube
- [[https://www.youtube.com/watch?v=FtieBc3KptU&t=287s][Emacs for Writers]]
- [[https://www.youtube.com/watch?v=CGnt_PWoM5Y][Org Mode As A Tool For Reproducible Research (Evan Misshula)]]
- [[https://www.youtube.com/watch?v=FRu8SRWuUko][Emacs Configuration in 24 Minutes]]
