emacs-packages-orgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-19 周日 11:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Orgmode Introduction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Orgmode Introduction</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org04b8f84">1. What is Orgmode</a></li>
<li><a href="#org8314eb3">2. Functions</a></li>
<li><a href="#org119d8f0">3. Index</a>
<ul>
<li><a href="#orge80973c">3.1. Website</a></li>
<li><a href="#org656797c">3.2. Youtube</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org04b8f84" class="outline-2">
<h2 id="org04b8f84"><span class="section-number-2">1</span> What is Orgmode</h2>
<div class="outline-text-2" id="text-1">
<p>
Orgmode is a system for note taking and project planning using plain text files.
The author is <a href="https://staff.science.uva.nl/c.dominik/">Carsten Dominik</a>, created in 2003.
</p>

<p>
Ref Orgmode <a href="http://orgmode.org/">Homepage</a> and <a href="https://www.youtube.com/watch?v=oJTwQvgfgMM">Youtube</a> for more details
</p>

<p>
Core advantage: Plain text <a href="http://gettingthingsdone.com/">GTD</a> tools. Truely Portable Format. Working together
with UNIX tools(e.g.: grep), git, and process easily by python, shell, etc.
</p>
</div>
</div>

<div id="outline-container-org8314eb3" class="outline-2">
<h2 id="org8314eb3"><span class="section-number-2">2</span> Functions</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Outline</li>
<li>Planning</li>
<li>Schedule</li>
<li>Capture</li>
<li>Sparse Tree</li>
<li>Agenda View</li>
<li>Export</li>
<li>Publish</li>
<li>Tables</li>
</ul>
</div>
</div>

<div id="outline-container-org119d8f0" class="outline-2">
<h2 id="org119d8f0"><span class="section-number-2">3</span> Index</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge80973c" class="outline-3">
<h3 id="orge80973c"><span class="section-number-3">3.1</span> Website</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org">一年成为 Emacs 高手 (像神一样使用编辑器)</a></li>
<li><a href="https://www.sanityinc.com/">Steve Purcell</a></li>
<li><a href="https://cestlaz.github.io/stories/emacs/">Using Emacs Series</a> (<a href="https://github.com/zamansky/using-emacs/">Using Emacs</a> <a href="https://cestlaz.github.io/">Github IO</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org656797c" class="outline-3">
<h3 id="org656797c"><span class="section-number-3">3.2</span> Youtube</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=FtieBc3KptU&amp;t=287s">Emacs for Writers</a></li>
<li><a href="https://www.youtube.com/watch?v=CGnt_PWoM5Y">Org Mode As A Tool For Reproducible Research (Evan Misshula)</a></li>
<li><a href="https://www.youtube.com/watch?v=FRu8SRWuUko">Emacs Configuration in 24 Minutes</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
